{
  "education": [
    {
      "awards_achievements": [
        "Concentration in Software Engineering"
      ],
      "degree": "Bachelor of Science",
      "department": "Computer Science",
      "duration": "2015-2020",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_MichaelChen",
  "highlighted_projects": [
    {
      "description": "Created a series of web apps as prescribed by theodinproject.com. Practiced Rails concepts such as MVC design pattern, Active Record, associations. Deployed RESTful apps on Heroku with support for REST clients.",
      "git_url": "https://github.com/mwcchen",
      "name": "The Odin Project Rails Course Projects"
    },
    {
      "description": "Created a Python backend for handling flashcard reviews, like Anki. The system was designed using the SuperMemo-2 algorithm for regulating the frequency and scheduling of flashcards. Implemented efficient card statistics management using MYSQL which supports multiple users. A JSON REST API is provided to handle remote database queries and the system automatically handles review conflicts by considering the earliest review.",
      "git_url": null,
      "name": "SRS Flashcard App Backend"
    },
    {
      "description": "Wrote a paper on Maxim Gumin's WaveFunctionCollapse algorithm. The program takes a bitmap input and synthesizes bitmaps that retain local features of the input while generating new general features. Implemented functionality for generating only in a local area of an image. Explored how to avoid over/under-fitting properties based on given parameters. Analyzed runtime and optimized algorithm by generating only what is needed at the time.",
      "git_url": null,
      "name": "WaveFunctionCollapse"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed an app for automated collection of system specifications and node resource usage in a Linux server cluster. Implemented info collection scripts in Bash, designed PostgreSQL database, and wrote SQL queries for compiling and fetching useful aggregate information. Tested app manually on remote CentOS nodes; input was fed by hand and tried against valid and invalid input with all tests passing. Deployed the app with Docker to contain the PostgreSQL database and crontab set up to execute Bash scripts.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": [
        "Grep App: Java 8 implementation of a simplified version of grep, using Lambda and Stream API for processing large files, written in IntelliJ.",
        "JDBC App: Java app for interacting with PSQL database through Java's JDBC API with PSQL driver, feature DAO implementation for data access."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Michael Chen",
  "others": [
    {
      "bullets": [
        "EMC Academic Associate, Data Science and Big Data Analytics (2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Volunteer, Japanese Canadian Cultural Centre",
        "Natural Languages: English, Chinese, Japanese",
        "Literary translation",
        "Language exchange",
        "Hiking",
        "Camping",
        "Biking"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated with peers to solve real-world problems with modern technologies. Studied Data Engineering fundamentals by creating data aggregation apps and command line apps, deployed with Docker. Development followed Agile methodologies under a Scrum framework, with ceremonies conducted by fellow developers.",
      "duration": "2021-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Ruby on Rails",
      "Node.js",
      "Angular",
      "HTML/CSS",
      "UI/UX design",
      "Software Testing"
    ],
    "familiar": [
      "C/C++",
      "Machine Learning",
      "Computer Vision",
      "Blockchain",
      "Natural Language Processing"
    ],
    "proficient": [
      "Java",
      "Python",
      "Algorithms/Data structures",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate from Ryerson University and received a Bachelor's degree in Computer Science. In school, I undertook a concentration in Software Engineering. I am passionate about algorithm optimization, data structure design, and writing clean, readable code. I believe that my expertise and passion will lead me to success in this industry.\nDuring my years in school, some of the most important lessons I learned were through interactions and collaboration with classmates. It was during group projects that I learned the importance of high-level communication. I hold transparency, accountability, and willingness to ask for and receive help as of the highest value.\nAt this point in my career, I'm open to exploring new opportunities. I have confidence in my strength in analyzing problems and designing algorithms to solve them. It would be my dream come true to contribute to a distinguished codebase as a significant milestone for one of the greatest pursuits of my life: a career in cutting-edge tech."
}
